/* 
  Common.strings
  Secrets

  Created by Paulo Andrade on 29/11/14.
  Copyright (c) 2016 Outer Corner. All rights reserved.
*/

"Passphrase" = "Senha";
"ConfirmPassphrase" = "Confirmar senha";
"EnterPassphrase" = "Insira sua senha";


// password strength
"PasswordScore.VeryWeak" = "muito fraca";
"PasswordScore.Weak" = "fraca";
"PasswordScore.OK" = "ok";
"PasswordScore.Good" = "boa";
"PasswordScore.Excellent" = "excelente";


// Button titles
"Button.Show" = "Mostrar";
"Button.Hide" = "Ocultar";
"Button.Copy" = "Copiar";
"Button.Reveal" = "Revelar";
"Button.Conceal" = "Esconder";
"Button.Recover" = "Recuperar";
"Button.Trash" = "Lixeira";
"Button.MoveToTrash" = "Mover para Lixeira";
"Button.Cancel" = "Cancelar";
"Button.OK" = "OK";
"Button.Done" = "Concluído";
"Button.Continue" = "Continuar";
"Button.Close" = "Fechar";
"Button.Edit" = "Editar";
"Button.Back" = "Voltar";
"Button.Fill" = "Preencher";
"Button.Send" = "Enviar";
"Button.FillOptions" = "Preencher...";
"Button.AssociateAndFill" = "Associar e Preencher";
"Button.Delete" = "Excluir";
"Button.Add" = "Adicionar";
"Button.Restore" = "Restaurar";
"Button.Sync" = "Sincronizar";
"Button.NotNow" = "Agora não";
"Button.Update" = "Atualizar";
"Button.ChangePassphrase" = "Alterar Senha";
"Button.Change" = "Alterar";
"Button.DeleteiCloudData" = "Excluir Dados do iCloud";
"Button.YesSure" = "Sim, tenho certeza";
"Button.YesDelete" = "Sim, excluir";
"Button.Reset" = "Redefinir";
"Button.Unlock" = "Desbloquear";
"Button.Enable" = "Habilitar";
"Button.Disable" = "Desabilitar";
"Button.Dismiss" = "Ignorar";
"Button.Refresh" = "Atualizar";
"Button.Upgrade" = "Atualizar";

// Filters
"Filter.All" = "Todos";
"Filter.AllItems" = "Todos os Itens";
"Filter.Trash" = "Lixeira";


/* Copy item action */
"Action.CopyItem" = "Copiar %@";
"Action.CopyItem2Lines" = "Copiar\n%@";
"Action.RevealItem" = "Revelar %@";
"Action.ConcealItem" = "Esconder %@";
"Action.RecoverItem" = "Recuperar %@";
"Action.FillItem" = "Preencher %@";
"Action.SendItem" = "Enviar %@ para aplicativo solicitante";
"Action.MoveItemToTrash" = "Mover %@ para Lixeira";
"Action.DeleteItem" = "Excluir %@";

/* Option presented when nothing is found for a given search string. Eg: Add Login for "twitter" */
"Search.AddItem" = "Adicionar %@ para \"%@\"";
/* Presented when nothing is found for a given search string. Eg: No logins found */
"Search.NoResultsTitle" = "Nenhum(a) %@ encontrado(a)";
/* Presented when nothing is found for a given search string. Eg: Couldn't find any logins matching you search. */
"Search.NoResultsDetailed" = "Não foi possível encontrar nenhum(a) %@ correspondente à sua pesquisa.";
/* Trash is empty title */
"Search.TrashEmptyTitle" = "Nenhum item na Lixeira";
/* Trash is empty message */
"Search.TrashEmptyMessage" = "Parece que você não enviou nenhum segredo para a Lixeira.";
/* Empty section title */
"Search.SectionEmptyTitle" = "Nenhum(a) %@ para mostrar";
/* Empty section message */
"Search.SectionEmptyMessage" = "Adicione um(a) %@ ao pressionar o botão + acima.";
/* Empty section message touch */
"Search.SectionEmptyMessageTouch" = "Adicione um(a) %@ ao pressionar o botão + abaixo.";


// iCloud & Sync
"iCloud.CredentialItemName" = "Senha de sincronização do iCloud %@";
"iCloud.CredentialNoteContent" = "Esta entrada foi gerada automaticamente durante a configuração do iCloud. Ela é usada internamente para sincronização com o iCloud.\nVocê pode alterar o nome e/ou nome de usuário, mas não modifique a senha e o serviço associado do iCloud. Obrigado :)";
/* Merge notice */
"Sync.AutomaticallyMergedNotice" = "Mesclado automaticamente devido a um conflito em %@";
/* Presented on a small overlay when the app is syncing */
"Sync.Syncing" = "Sincronizando";
/* Presented when iCloud sync is uploading the file data */
"Sync.WaitingForUpload" = "Aguardando fim do upload...";
/* Last sync date */
"Sync.LastSynced" = "Última sincronização: %@";
/* Title for "passphrase not synced" alert */
"iCloud.ChangePassphraseAlert.Title" = "Sua senha não é sincronizada automaticamente através do iCloud";
/* Message for "passphrase not synced" alert */
"iCloud.ChangePassphraseAlert.Message" = "Você deve atualizar a sua senha manualmente nos seus outros dispositivos para continuar usando o iCloud Sync.";

/* Asked during setup when iCloud data already exists */
"iCloud.ShouldRestore" = "Você deseja restaurar seus dados do iCloud?";
/* Asked during setup when creating a new iCloud store */
"iCloud.ShouldSync" = "Você deseja sincronizar com o iCloud?";

"iCloud.SetupFailedAlert.Title" = "Não foi possível habilitar o iCloud Sync";
"iCloud.SetupFailedAlert.Message" = "Tente habilitar novamente mais tarde";
"iCloud.SetupFailedAlert.MessageTouch" = "Tente habilitar novamente mais tarde nas Configurações";

/* Presented during setup while checking for iCloud data */
"iCloud.CheckingiCloud" = "Verificando iCloud…";

/* Alert title when trying to enable iCloud syncing */
"iCloud.NotAvailableAlert.Title" = "O iCloud não está disponível";
/* Alert message when trying to enable iCloud syncing */
"iCloud.NotAvailableAlert.Message" = "Assegure que você esteja conectado ao iCloud e possua \"Documentos e Dados\" habilitado nas Preferências do Sistema.";
"iCloud.NotAvailableAlert.MessageTouch" = "Assegure que você esteja conectado ao iCloud.";

/* Disable iCloud confirmation dialog title */
"iCloud.DisableSyncAlert.Title" = "Você deseja mesmo desabilitar a sincronização do iCloud?";
/* Disable iCloud confirmation dialog message */
"iCloud.DisableSyncAlert.Message" = "Ao desabilitar a sincronização, as alterações realizadas neste dispositivo não serão sincronizadas com o iCloud e vice-versa";

/* Delete iCloud confirmation dialog title */
"iCloud.DeleteDataAlert.Title" = "Você deseja mesmo excluir seus dados do iCloud?";
/* Delete iCloud confirmation dialog message */
"iCloud.DeleteDataAlert.Message" = "Isto impedirá a sincronização de outros dispositivos atualmente pareados com a sua conta do iCloud. Você deverá reconfigurar a sincronização do iCloud em todos eles.";

/* Sync with iCloud setting */
"iCloud.SyncSetting" = "Sincronizar com iCloud";
/* Sync with iCloud explanation */
"iCloud.Info" = "O iCloud Sync permite que você acesse seus dados em todos os seus dispositivos.";
/* iCloud Sync footer explanation when iCloud store file is missing */
"iCloud.Status.Missing" = "Os dados do iCloud estão ausentes. Você pode tê-los excluído em outro dispositivo. Para reativar a sincronização do iCloud, você precisa desabilitá-la e habilitá-la novamente.";
/* iCloud Sync footer explanation when iCloud is unavailable but enabled */
"iCloud.Status.EnabledButUnavailable" = "O iCloud não está acessível. Você pode ter saído do iCloud ou conectado como um usuário diferente.";
/* iCloud Sync footer explanation when iCloud is unavailable and disabled */
"iCloud.Status.DisabledAndUnavailable" = "O iCloud não está acessível. Você pode ter saído do iCloud.";



/* Delete multiple item confirmation alert title */
"Alert.PermanentlyDelete.Title" = "Excluir permanentemente %d itens";
/* Delete multiple item confirmation alert message */
"Alert.PermanentlyDelete.Message" = "Você deseja mesmo excluir permanentemente estes %d itens?";

"Alert.PremiumRequired.Title" = "Versão Premium necessária";
"Alert.PremiumRequired.Message" = "Atualize para Premium para criar e sincronizar mais de %d itens.";

// Store
"Store.Version.Free" = "Grátis";
"Store.Version.Premium" = "Premium";

"Store.Button.Buy" = "Comprar %@";
"Store.Button.Restore" = "Já comprou? Restaure ≫";

"Store.PremiumUpgrade.Title" = "Atualize para Premium";
"Store.PremiumUpgrade.Message" = "Ao atualizar poderá criar itens ilimitados. Só é necessário comprar uma vez.";

"Store.ProcessingTransaction.Title" = "Processando…";
"Store.ProcessingTransaction.Message" = "Aguardando o término da transação.";

"Store.HasPremium.Title" = "Premium Ativado 🎉";
"Store.HasPremium.Message" = "Você tem a versão Premium do Secrets. Obrigado!";

"Store.WaitingOnTransaction.Title" = "Esperando autorização";
"Store.WaitingOnTransaction.Message" = "A sua compra está pendente aprovação do responsável de família.";

"Store.TransactionFailed.Title" = "Transação Falhou";
"Store.TransactionFailed.Message" = "Por favor tente novamente.";

"Store.OtherPlaformNotIncluded" = "Versão Premium para %@ vendida separadamente.";

// New item
"NewItem.FreeVersionLimit" = "A versão Grátis tem um limite de %d itens.";
"NewItem.ItemsLeft" = "Pode criar mais %d itens.";

/* Phrase for system's authentication prompt when unlocking secrets */
"DeviceAuthentication.AuthRequiredToUnlock" = "Autentique para desbloquear seus segredos";
"DeviceAuthentication.UnlockSecrets" = "Desbloquear seus segredos";
